src/backend/test/load/relatorio_A.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load_test_a.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m01.0s/5m0s

running (0m02.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.0s/5m0s

running (0m03.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.0s/5m0s

running (0m04.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m04.0s/5m0s

running (0m05.0s), 10/10 VUs, 14 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.0s/5m0s

running (0m06.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.0s/5m0s

running (0m07.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m07.0s/5m0s

running (0m08.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.0s/5m0s

running (0m09.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.0s/5m0s

running (0m10.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m10.0s/5m0s

running (0m11.0s), 10/10 VUs, 39 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.0s/5m0s

running (0m12.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.0s/5m0s

running (0m13.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m13.0s/5m0s

running (0m14.0s), 10/10 VUs, 51 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.0s/5m0s

running (0m15.0s), 10/10 VUs, 54 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.0s/5m0s

running (0m16.0s), 10/10 VUs, 61 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m16.0s/5m0s

running (0m17.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.0s/5m0s

running (0m18.0s), 10/10 VUs, 64 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.0s/5m0s

running (0m19.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m19.0s/5m0s

running (0m20.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.0s/5m0s

running (0m21.0s), 10/10 VUs, 74 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.0s/5m0s

running (0m22.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m22.0s/5m0s

running (0m23.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.0s/5m0s

running (0m24.0s), 10/10 VUs, 85 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.0s/5m0s

running (0m25.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m25.0s/5m0s

running (0m26.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.0s/5m0s

running (0m27.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.0s/5m0s

running (0m28.0s), 10/10 VUs, 106 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m28.0s/5m0s

running (0m29.0s), 10/10 VUs, 106 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.0s/5m0s

running (0m30.0s), 10/10 VUs, 111 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.0s/5m0s

running (0m31.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m31.0s/5m0s

running (0m32.0s), 10/10 VUs, 124 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m32.0s/5m0s

running (0m33.0s), 10/10 VUs, 125 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m33.0s/5m0s

running (0m34.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m34.0s/5m0s

running (0m35.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m35.0s/5m0s

running (0m36.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m36.0s/5m0s

running (0m37.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m37.0s/5m0s

running (0m38.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m38.0s/5m0s

running (0m39.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m39.0s/5m0s

running (0m40.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m40.0s/5m0s

running (0m41.0s), 10/10 VUs, 164 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m41.0s/5m0s

running (0m42.0s), 10/10 VUs, 174 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m42.0s/5m0s

running (0m43.0s), 10/10 VUs, 177 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m43.0s/5m0s

running (0m44.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m44.0s/5m0s

running (0m45.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m45.0s/5m0s

running (0m46.0s), 10/10 VUs, 199 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m46.0s/5m0s

running (0m47.0s), 10/10 VUs, 201 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m47.0s/5m0s

running (0m48.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m48.0s/5m0s

running (0m49.0s), 10/10 VUs, 215 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m49.0s/5m0s

running (0m50.0s), 10/10 VUs, 221 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m50.0s/5m0s

running (0m51.0s), 10/10 VUs, 227 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m51.0s/5m0s

running (0m52.0s), 10/10 VUs, 233 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m52.0s/5m0s

running (0m53.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m53.0s/5m0s

running (0m54.0s), 10/10 VUs, 244 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m54.0s/5m0s

running (0m55.0s), 10/10 VUs, 253 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m55.0s/5m0s

running (0m56.0s), 10/10 VUs, 255 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m56.0s/5m0s

running (0m57.0s), 10/10 VUs, 259 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m57.0s/5m0s

running (0m58.0s), 10/10 VUs, 265 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m58.0s/5m0s

running (0m59.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m59.0s/5m0s

running (1m00.0s), 10/10 VUs, 277 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m00.0s/5m0s

running (1m01.0s), 10/10 VUs, 284 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m01.0s/5m0s

running (1m02.0s), 10/10 VUs, 287 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m02.0s/5m0s

running (1m03.0s), 10/10 VUs, 296 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m03.0s/5m0s

running (1m04.0s), 10/10 VUs, 299 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m04.0s/5m0s

running (1m05.0s), 10/10 VUs, 309 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m05.0s/5m0s

running (1m06.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m06.0s/5m0s

running (1m07.0s), 10/10 VUs, 313 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m07.0s/5m0s

running (1m08.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m08.0s/5m0s

running (1m09.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m09.0s/5m0s

running (1m10.0s), 10/10 VUs, 323 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m10.0s/5m0s

running (1m11.0s), 10/10 VUs, 332 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m11.0s/5m0s

running (1m12.0s), 10/10 VUs, 332 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m12.0s/5m0s

running (1m13.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m13.0s/5m0s

running (1m14.0s), 10/10 VUs, 344 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m14.0s/5m0s

running (1m15.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m15.0s/5m0s

running (1m16.0s), 10/10 VUs, 356 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m16.0s/5m0s

running (1m17.0s), 10/10 VUs, 363 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m17.0s/5m0s

running (1m18.0s), 10/10 VUs, 368 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m18.0s/5m0s

running (1m19.0s), 10/10 VUs, 376 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m19.0s/5m0s

running (1m20.0s), 10/10 VUs, 379 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m20.0s/5m0s

running (1m21.0s), 10/10 VUs, 386 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m21.0s/5m0s

running (1m22.0s), 10/10 VUs, 395 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m22.0s/5m0s

running (1m23.0s), 10/10 VUs, 397 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m23.0s/5m0s

running (1m24.0s), 10/10 VUs, 407 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m24.0s/5m0s

running (1m25.0s), 10/10 VUs, 407 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m25.0s/5m0s

running (1m26.0s), 10/10 VUs, 409 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m26.0s/5m0s

running (1m27.0s), 10/10 VUs, 411 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m27.0s/5m0s

running (1m28.0s), 10/10 VUs, 419 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m28.0s/5m0s

running (1m29.0s), 10/10 VUs, 420 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m29.0s/5m0s

running (1m30.0s), 10/10 VUs, 422 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m30.0s/5m0s

running (1m31.0s), 10/10 VUs, 431 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m31.0s/5m0s

running (1m32.0s), 10/10 VUs, 431 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m32.0s/5m0s

running (1m33.0s), 10/10 VUs, 434 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m33.0s/5m0s

running (1m34.0s), 10/10 VUs, 444 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m34.0s/5m0s

running (1m35.0s), 10/10 VUs, 445 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m35.0s/5m0s

running (1m36.0s), 10/10 VUs, 447 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m36.0s/5m0s

running (1m37.0s), 10/10 VUs, 457 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m37.0s/5m0s

running (1m38.0s), 10/10 VUs, 458 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m38.0s/5m0s

running (1m39.0s), 10/10 VUs, 459 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m39.0s/5m0s

running (1m40.0s), 10/10 VUs, 462 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m40.0s/5m0s

running (1m41.0s), 10/10 VUs, 470 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m41.0s/5m0s

running (1m42.0s), 10/10 VUs, 472 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m42.0s/5m0s

running (1m43.0s), 10/10 VUs, 475 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m43.0s/5m0s

running (1m44.0s), 10/10 VUs, 483 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m44.0s/5m0s

running (1m45.0s), 10/10 VUs, 483 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m45.0s/5m0s

running (1m46.0s), 10/10 VUs, 488 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m46.0s/5m0s

running (1m47.0s), 10/10 VUs, 497 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m47.0s/5m0s

running (1m48.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m48.0s/5m0s

running (1m49.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m49.0s/5m0s

running (1m50.0s), 10/10 VUs, 501 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m50.0s/5m0s

running (1m51.0s), 10/10 VUs, 502 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m51.0s/5m0s

running (1m52.0s), 10/10 VUs, 510 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m52.0s/5m0s

running (1m53.0s), 10/10 VUs, 510 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m53.0s/5m0s

running (1m54.0s), 10/10 VUs, 512 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m54.0s/5m0s

running (1m55.0s), 10/10 VUs, 512 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m55.0s/5m0s

running (1m56.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m56.0s/5m0s

running (1m57.0s), 10/10 VUs, 522 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m57.0s/5m0s

running (1m58.0s), 10/10 VUs, 523 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m58.0s/5m0s

running (1m59.0s), 10/10 VUs, 524 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m59.0s/5m0s

running (2m00.0s), 10/10 VUs, 524 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m00.0s/5m0s

running (2m01.0s), 10/10 VUs, 527 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m01.0s/5m0s

running (2m02.0s), 10/10 VUs, 534 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m02.0s/5m0s

running (2m03.0s), 10/10 VUs, 535 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m03.0s/5m0s

running (2m04.0s), 10/10 VUs, 535 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m04.0s/5m0s

running (2m05.0s), 10/10 VUs, 536 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m05.0s/5m0s

running (2m06.0s), 10/10 VUs, 538 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m06.0s/5m0s

running (2m07.0s), 10/10 VUs, 545 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m07.0s/5m0s

running (2m08.0s), 10/10 VUs, 545 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m08.0s/5m0s

running (2m09.0s), 10/10 VUs, 546 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m09.0s/5m0s

running (2m10.0s), 10/10 VUs, 546 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m10.0s/5m0s

running (2m11.0s), 10/10 VUs, 546 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m11.0s/5m0s

running (2m12.0s), 10/10 VUs, 556 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m12.0s/5m0s

running (2m13.0s), 10/10 VUs, 556 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m13.0s/5m0s

running (2m14.0s), 10/10 VUs, 557 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m14.0s/5m0s

running (2m15.0s), 10/10 VUs, 557 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m15.0s/5m0s

running (2m16.0s), 10/10 VUs, 559 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m16.0s/5m0s

running (2m17.0s), 10/10 VUs, 567 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m17.0s/5m0s

running (2m18.0s), 10/10 VUs, 567 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m18.0s/5m0s

running (2m19.0s), 10/10 VUs, 569 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m19.0s/5m0s

running (2m20.0s), 10/10 VUs, 569 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m20.0s/5m0s

running (2m21.0s), 10/10 VUs, 574 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m21.0s/5m0s

running (2m22.0s), 10/10 VUs, 579 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m22.0s/5m0s

running (2m23.0s), 10/10 VUs, 581 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m23.0s/5m0s

running (2m24.0s), 10/10 VUs, 581 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m24.0s/5m0s

running (2m25.0s), 10/10 VUs, 585 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m25.0s/5m0s

running (2m26.0s), 10/10 VUs, 591 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m26.0s/5m0s

running (2m27.0s), 10/10 VUs, 593 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m27.0s/5m0s

running (2m28.0s), 10/10 VUs, 593 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m28.0s/5m0s

running (2m29.0s), 10/10 VUs, 594 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m29.0s/5m0s

running (2m30.0s), 10/10 VUs, 603 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m30.0s/5m0s

running (2m31.0s), 10/10 VUs, 603 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m31.0s/5m0s

running (2m32.0s), 10/10 VUs, 605 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m32.0s/5m0s

running (2m33.0s), 10/10 VUs, 605 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m33.0s/5m0s

running (2m34.0s), 10/10 VUs, 606 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m34.0s/5m0s

running (2m35.0s), 10/10 VUs, 615 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m35.0s/5m0s

running (2m36.0s), 10/10 VUs, 615 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m36.0s/5m0s

running (2m37.0s), 10/10 VUs, 617 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m37.0s/5m0s

running (2m38.0s), 10/10 VUs, 618 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m38.0s/5m0s

running (2m39.0s), 10/10 VUs, 618 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m39.0s/5m0s

running (2m40.0s), 10/10 VUs, 627 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m40.0s/5m0s

running (2m41.0s), 10/10 VUs, 628 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m41.0s/5m0s

running (2m42.0s), 10/10 VUs, 629 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m42.0s/5m0s

running (2m43.0s), 10/10 VUs, 630 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m43.0s/5m0s

running (2m44.0s), 10/10 VUs, 638 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m44.0s/5m0s

running (2m45.0s), 10/10 VUs, 641 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m45.0s/5m0s

running (2m46.0s), 10/10 VUs, 641 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m46.0s/5m0s

running (2m47.0s), 10/10 VUs, 641 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m47.0s/5m0s

running (2m48.0s), 10/10 VUs, 651 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m48.0s/5m0s

running (2m49.0s), 10/10 VUs, 651 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m49.0s/5m0s

running (2m50.0s), 10/10 VUs, 652 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m50.0s/5m0s

running (2m51.0s), 10/10 VUs, 652 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m51.0s/5m0s

running (2m52.0s), 10/10 VUs, 655 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m52.0s/5m0s

running (2m53.0s), 10/10 VUs, 663 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m53.0s/5m0s

running (2m54.0s), 10/10 VUs, 664 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m54.0s/5m0s

running (2m55.0s), 10/10 VUs, 665 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m55.0s/5m0s

running (2m56.0s), 10/10 VUs, 673 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m56.0s/5m0s

running (2m57.0s), 10/10 VUs, 673 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m57.0s/5m0s

running (2m58.0s), 10/10 VUs, 678 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m58.0s/5m0s

running (2m59.0s), 10/10 VUs, 679 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m59.0s/5m0s

running (3m00.0s), 10/10 VUs, 688 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m00.0s/5m0s

running (3m01.0s), 10/10 VUs, 689 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m01.0s/5m0s

running (3m02.0s), 10/10 VUs, 689 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m02.0s/5m0s

running (3m03.0s), 10/10 VUs, 691 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m03.0s/5m0s

running (3m04.0s), 10/10 VUs, 699 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m04.0s/5m0s

running (3m05.0s), 10/10 VUs, 703 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m05.0s/5m0s

running (3m06.0s), 10/10 VUs, 705 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m06.0s/5m0s

running (3m07.0s), 10/10 VUs, 715 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m07.0s/5m0s

running (3m08.0s), 10/10 VUs, 715 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m08.0s/5m0s

running (3m09.0s), 10/10 VUs, 722 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m09.0s/5m0s

running (3m10.0s), 10/10 VUs, 727 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m10.0s/5m0s

running (3m11.0s), 10/10 VUs, 730 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m11.0s/5m0s

running (3m12.0s), 10/10 VUs, 740 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m12.0s/5m0s

running (3m13.0s), 10/10 VUs, 741 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m13.0s/5m0s

running (3m14.0s), 10/10 VUs, 742 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m14.0s/5m0s

running (3m15.0s), 10/10 VUs, 752 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m15.0s/5m0s

running (3m16.0s), 10/10 VUs, 753 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m16.0s/5m0s

running (3m17.0s), 10/10 VUs, 754 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m17.0s/5m0s

running (3m18.0s), 10/10 VUs, 755 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m18.0s/5m0s

running (3m19.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m19.0s/5m0s

running (3m20.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m20.0s/5m0s

running (3m21.0s), 10/10 VUs, 765 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m21.0s/5m0s

running (3m22.0s), 10/10 VUs, 775 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m22.0s/5m0s

running (3m23.0s), 10/10 VUs, 776 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m23.0s/5m0s

running (3m24.0s), 10/10 VUs, 777 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m24.0s/5m0s

running (3m25.0s), 10/10 VUs, 787 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m25.0s/5m0s

running (3m26.0s), 10/10 VUs, 787 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m26.0s/5m0s

running (3m27.0s), 10/10 VUs, 788 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m27.0s/5m0s

running (3m28.0s), 10/10 VUs, 798 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m28.0s/5m0s

running (3m29.0s), 10/10 VUs, 798 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m29.0s/5m0s

running (3m30.0s), 10/10 VUs, 800 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m30.0s/5m0s

running (3m31.0s), 10/10 VUs, 810 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m31.0s/5m0s

running (3m32.0s), 10/10 VUs, 810 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m32.0s/5m0s

running (3m33.0s), 10/10 VUs, 812 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m33.0s/5m0s

running (3m34.0s), 10/10 VUs, 814 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m34.0s/5m0s

running (3m35.0s), 10/10 VUs, 822 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m35.0s/5m0s

running (3m36.0s), 10/10 VUs, 822 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m36.0s/5m0s

running (3m37.0s), 10/10 VUs, 823 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m37.0s/5m0s

running (3m38.0s), 10/10 VUs, 833 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m38.0s/5m0s

running (3m39.0s), 10/10 VUs, 833 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m39.0s/5m0s

running (3m40.0s), 10/10 VUs, 834 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m40.0s/5m0s

running (3m41.0s), 10/10 VUs, 844 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m41.0s/5m0s

running (3m42.0s), 10/10 VUs, 845 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m42.0s/5m0s

running (3m43.0s), 10/10 VUs, 845 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m43.0s/5m0s

running (3m44.0s), 10/10 VUs, 855 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m44.0s/5m0s

running (3m45.0s), 10/10 VUs, 855 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m45.0s/5m0s

running (3m46.0s), 10/10 VUs, 858 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m46.0s/5m0s

running (3m47.0s), 10/10 VUs, 868 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m47.0s/5m0s

running (3m48.0s), 10/10 VUs, 870 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m48.0s/5m0s

running (3m49.0s), 10/10 VUs, 870 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m49.0s/5m0s

running (3m50.0s), 10/10 VUs, 872 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m50.0s/5m0s

running (3m51.0s), 10/10 VUs, 873 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m51.0s/5m0s

running (3m52.0s), 10/10 VUs, 881 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m52.0s/5m0s

running (3m53.0s), 10/10 VUs, 883 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m53.0s/5m0s

running (3m54.0s), 10/10 VUs, 884 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m54.0s/5m0s

running (3m55.0s), 10/10 VUs, 886 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m55.0s/5m0s

running (3m56.0s), 10/10 VUs, 886 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m56.0s/5m0s

running (3m57.0s), 10/10 VUs, 894 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m57.0s/5m0s

running (3m58.0s), 10/10 VUs, 894 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m58.0s/5m0s

running (3m59.0s), 10/10 VUs, 896 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m59.0s/5m0s

running (4m00.0s), 10/10 VUs, 897 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m00.0s/5m0s

running (4m01.0s), 10/10 VUs, 897 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m01.0s/5m0s

running (4m02.0s), 10/10 VUs, 905 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m02.0s/5m0s

running (4m03.0s), 10/10 VUs, 906 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m03.0s/5m0s

running (4m04.0s), 10/10 VUs, 906 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m04.0s/5m0s

running (4m05.0s), 10/10 VUs, 909 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m05.0s/5m0s

running (4m06.0s), 10/10 VUs, 916 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m06.0s/5m0s

running (4m07.0s), 10/10 VUs, 916 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m07.0s/5m0s

running (4m08.0s), 10/10 VUs, 919 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m08.0s/5m0s

running (4m09.0s), 10/10 VUs, 919 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m09.0s/5m0s

running (4m10.0s), 10/10 VUs, 926 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m10.0s/5m0s

running (4m11.0s), 10/10 VUs, 926 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m11.0s/5m0s

running (4m12.0s), 10/10 VUs, 928 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m12.0s/5m0s

running (4m13.0s), 10/10 VUs, 928 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m13.0s/5m0s

running (4m14.0s), 10/10 VUs, 929 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m14.0s/5m0s

running (4m15.0s), 10/10 VUs, 938 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m15.0s/5m0s

running (4m16.0s), 10/10 VUs, 938 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m16.0s/5m0s

running (4m17.0s), 10/10 VUs, 940 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m17.0s/5m0s

running (4m18.0s), 10/10 VUs, 941 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m18.0s/5m0s

running (4m19.0s), 10/10 VUs, 950 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m19.0s/5m0s

running (4m20.0s), 10/10 VUs, 950 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m20.0s/5m0s

running (4m21.0s), 10/10 VUs, 952 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m21.0s/5m0s

running (4m22.0s), 10/10 VUs, 953 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m22.0s/5m0s

running (4m23.0s), 10/10 VUs, 955 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m23.0s/5m0s

running (4m24.0s), 10/10 VUs, 962 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m24.0s/5m0s

running (4m25.0s), 10/10 VUs, 965 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m25.0s/5m0s

running (4m26.0s), 10/10 VUs, 966 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m26.0s/5m0s

running (4m27.0s), 10/10 VUs, 968 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m27.0s/5m0s

running (4m28.0s), 10/10 VUs, 970 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m28.0s/5m0s

running (4m29.0s), 10/10 VUs, 976 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m29.0s/5m0s

running (4m30.0s), 10/10 VUs, 978 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m30.0s/5m0s

running (4m31.0s), 10/10 VUs, 983 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m31.0s/5m0s

running (4m32.0s), 10/10 VUs, 987 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m32.0s/5m0s

running (4m33.0s), 10/10 VUs, 988 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m33.0s/5m0s

running (4m34.0s), 10/10 VUs, 990 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m34.0s/5m0s

running (4m35.0s), 10/10 VUs, 998 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m35.0s/5m0s

running (4m36.0s), 10/10 VUs, 998 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m36.0s/5m0s

running (4m37.0s), 10/10 VUs, 999 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m37.0s/5m0s

running (4m38.0s), 10/10 VUs, 1000 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m38.0s/5m0s

running (4m39.0s), 10/10 VUs, 1002 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m39.0s/5m0s

running (4m40.0s), 10/10 VUs, 1009 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m40.0s/5m0s

running (4m41.0s), 10/10 VUs, 1009 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m41.0s/5m0s

running (4m42.0s), 10/10 VUs, 1010 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m42.0s/5m0s

running (4m43.0s), 10/10 VUs, 1011 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m43.0s/5m0s

running (4m44.0s), 10/10 VUs, 1012 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m44.0s/5m0s

running (4m45.0s), 10/10 VUs, 1020 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m45.0s/5m0s

running (4m46.0s), 10/10 VUs, 1021 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m46.0s/5m0s

running (4m47.0s), 10/10 VUs, 1024 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m47.0s/5m0s

running (4m48.0s), 10/10 VUs, 1024 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m48.0s/5m0s

running (4m49.0s), 10/10 VUs, 1026 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m49.0s/5m0s

running (4m50.0s), 10/10 VUs, 1034 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m50.0s/5m0s

running (4m51.0s), 10/10 VUs, 1035 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m51.0s/5m0s

running (4m52.0s), 10/10 VUs, 1036 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m52.0s/5m0s

running (4m53.0s), 10/10 VUs, 1037 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m53.0s/5m0s

running (4m54.0s), 10/10 VUs, 1045 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m54.0s/5m0s

running (4m55.0s), 10/10 VUs, 1045 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m55.0s/5m0s

running (4m56.0s), 10/10 VUs, 1047 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m56.0s/5m0s

running (4m57.0s), 10/10 VUs, 1047 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m57.0s/5m0s

running (4m58.0s), 10/10 VUs, 1048 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m58.0s/5m0s

running (4m59.0s), 10/10 VUs, 1057 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m59.0s/5m0s

running (5m00.0s), 10/10 VUs, 1058 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  5m0s

running (5m01.0s), 08/10 VUs, 1060 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m02.0s), 06/10 VUs, 1062 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

     █ Create Research

     █ Get All Researches

     █ Get Research by ID

     data_received..................: 5.0 GB 17 MB/s
     data_sent......................: 394 kB 1.3 kB/s
     group_duration.................: avg=783.24ms min=920.66µs med=105.67ms max=5.26s    p(90)=2.59s    p(95)=3.06s   
     http_req_blocked...............: avg=7.41µs   min=0s       med=3µs      max=4.3ms    p(90)=8µs      p(95)=14µs    
     http_req_connecting............: avg=1.41µs   min=0s       med=0s       max=490µs    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=443.54ms min=876µs    med=25.34ms  max=2.11s    p(90)=1.63s    p(95)=1.77s   
       { expected_response:true }...: avg=443.54ms min=876µs    med=25.34ms  max=2.11s    p(90)=1.63s    p(95)=1.77s   
     http_req_failed................: 0.00%  ✓ 0         ✗ 3204
     http_req_receiving.............: avg=70.62ms  min=6µs      med=63µs     max=783.72ms p(90)=335.62ms p(95)=499.24ms
     http_req_sending...............: avg=28.32µs  min=1µs      med=12µs     max=12.56ms  p(90)=43µs     p(95)=56.84µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=372.89ms min=850µs    med=25.26ms  max=2.09s    p(90)=1.3s     p(95)=1.52s   
     http_reqs......................: 3204   10.580353/s
     iteration_duration.............: avg=2.34s    min=485.5ms  med=2.26s    max=6.24s    p(90)=3.62s    p(95)=4.23s   
     iterations.....................: 1068   3.526784/s
     vus............................: 6      min=6       max=10
     vus_max........................: 10     min=10      max=10


running (5m02.8s), 00/10 VUs, 1068 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  5m0s